eiefirmware/razor_sam3u2/firmware_common/bsp/configuration.h
/*!*********************************************************************************************************************
@file configuration.h      
@brief Main configuration header file for project.  

This file bridges many of the generic features of the firmware to the 
specific features of the design. The definitions should be updated
to match the target hardware.  
 
Bookmarks:
!!!!! External module peripheral assignments
##### UART peripheral board-specific parameters
$$$$$ SPI peripheral board-specific parameters
%%%%% SSP peripheral board-specific parameters
^^^^^ I²C peripheral board-specific parameters


***********************************************************************************************************************/

#ifndef __CONFIG_H
#define __CONFIG_H

/**********************************************************************************************************************
Runtime switches
***********************************************************************************************************************/
//#define STARTUP_SOUND               /*!< Define to include buzzer sound on startup */

//#define EIE_DOTMATRIX_R01           /*!< Use with MPGL2-EHDW-01 revision board */


/**********************************************************************************************************************
Type Definitions
**********************************************************************************************************************/

/*! 
@enum PeripheralType
@brief Short names used to identify peripherals in their configuration structs.

This provides self-documentation when indexing peripherals and when assigning
better names for devices that make use of the peripherals.
*/
typedef enum {SPI0, UART, USART0, USART1, USART2, USART3} PeripheralType;


/**********************************************************************************************************************
Includes
***********************************************************************************************************************/
/* Common header files */
#include <stdlib.h>
#include <string.h>
#include "AT91SAM3U4.h"
#include "exceptions.h"
#include "interrupts.h"
#include "core_cm3.h"
#include "main.h"
#include "typedefs.h"
#include "utilities.h"

/* EIEF1_ASCII specific header files */
#ifdef EIE_ASCII
#include "eief1-pcb-01.h"
#include "lcd_nhd-c0220biz.h"
#endif /* EIE_ASCII */

#ifdef EIE_DOTMATRIX
/* EIE_DOTMATRIX-specific header files */
#ifdef EIE_DOTMATRIX_R01
#include "mpgl2-ehdw-01.h"
#else
#include "mpgl2-ehdw-02.h"
#endif /* EIE_DOTMATRIX_R01 */

#include "captouch.h"
#include "lcd_NHD-C12864LZ.h"
#include "lcd_bitmaps.h"
#endif /* EIE_DOTMATRIX */

/* Common driver header files */
#include "antmessage.h"
#include "antdefines.h"
#include "ant.h"
#include "ant_api.h"
#include "buttons.h"
#include "leds.h" 
#include "messaging.h"
#include "timer.h"

#include "sam3u_i2c.h"
#include "sam3u_spi.h"
#include "sam3u_ssp.h"
#include "sam3u_uart.h"
#include "adc12.h"

/* Common Blade header files */
#include "blade_api.h"
#include "blade_imu_lsm9ds1.h"

/* Common application header files */
#include "debug.h"
#include "music.h"
#include "user_app1.h"
#include "user_app2.h"
#include "user_app3.h"


/**********************************************************************************************************************
!!!!! External device peripheral assignments
***********************************************************************************************************************/

/* Peripheral assignments */
#define BLADE_UART                  UART
#define DEBUG_UART                  USART0
#define ANT_SPI                     USART2
#define BLADE_SPI                   SPI0
#define BLADE_I2C                   TWI0

#ifdef EIE_ASCII
#define LCD_I2C                     TWI0
#define SD_SSP                      USART1
#endif

#ifdef EIE_DOTMATRIX
#define LCD_SPI                     USART1
#endif


/* Global status flags for SPI peripherals */
#define BLADE_SPI_FLAGS             G_u32Spi0ApplicationFlags  /*!< @brief Assigns the correct global Application Flags to a self-documenting symbol */
#define SD_SSP_FLAGS                G_u32Ssp1ApplicationFlags  /*!< @brief Assigns the correct global Application Flags to a self-documenting symbol */
#define ANT_SSP_FLAGS               G_u32Ssp2ApplicationFlags  /*!< @brief Assigns the correct global Application Flags to a self-documenting symbol */


/*! @cond DOXYGEN_EXCLUDE */
/* %UART% Configuration */

/* Debug UART Peripheral Allocation (USART0) */
#define USART0_US_CR_INIT           DEBUG_UART_US_CR_INIT
#define USART0_US_MR_INIT           DEBUG_UART_US_MR_INIT
#define USART0_US_IER_INIT          DEBUG_UART_US_IER_INIT
#define USART0_US_IDR_INIT          DEBUG_UART_US_IDR_INIT
#define USART0_US_BRGR_INIT         DEBUG_UART_US_BRGR_INIT

#define UART0_IRQHandler            USART0_IrqHandler
#define DEBUG_UART_PERIPHERAL       AT91C_ID_US0

/* Blade UART Peripheral Allocation (UART) */
#define UART_US_CR_INIT             BLADE_UART_US_CR_INIT
#define UART_US_MR_INIT             BLADE_UART_US_MR_INIT
#define UART_US_IER_INIT            BLADE_UART_US_IER_INIT
#define UART_US_IDR_INIT            BLADE_UART_US_IDR_INIT
#define UART_US_BRGR_INIT           BLADE_UART_US_BRGR_INIT

#define UART_IRQHandler             DBGU_IrqHandler
#define BLADE_UART_PERIPHERAL       AT91C_ID_DBGU


/* %SPI% Configuration */

/* %SPI% Blade SPI Peripheral Allocation (SPI0) */
#define BLADE_BASE_PORT             AT91C_BASE_PIOA
#define BLADE_CS_PIN                PA_16_BLADE_CS
#define BLADE_SPI_FLAGS             G_u32Spi0ApplicationFlags
#define BLADE_SPI_PERIPHERAL        AT91C_ID_SPI0

#define SPI0_CR_INIT                BLADE_SPI_CR_INIT
#define SPI0_MR_INIT                BLADE_SPI_MR_INIT
#define SPI0_IER_INIT               BLADE_SPI_IER_INIT
#define SPI0_IDR_INIT               BLADE_SPI_IDR_INIT
#define SPI0_CSR0_INIT              BLADE_SPI_CSR0_INIT
#define SPI0_CSR1_INIT              BLADE_SPI_CSR1_INIT
#define SPI0_CSR2_INIT              BLADE_SPI_CSR2_INIT
#define SPI0_CSR3_INIT              BLADE_SPI_CSR3_INIT

#define SPI0_IRQHandler             SPI0_IrqHandler


/* %SSP% Configuration */

