eiefirmware/razor_sam3u2/firmware_common/bsp/configuration.h
#ifdef EIE_ASCII
/* SD SPI Peripheral Allocation (USART1) */
#define SD_BASE_PORT                AT91C_BASE_PIOA
#define SD_CS_PIN                   PA_08_SD_CS_MCDA3
#define USART1_US_CR_INIT           SD_SPI_US_CR_INIT
#define USART1_US_MR_INIT           SD_SPI_US_MR_INIT
#define USART1_US_IER_INIT          SD_SPI_US_IER_INIT
#define USART1_US_IDR_INIT          SD_SPI_US_IDR_INIT
#define USART1_US_BRGR_INIT         SD_SPI_US_BRGR_INIT

#define SSP1_IRQHandler             USART1_IrqHandler
#endif /* EIE_ASCII */

#ifdef EIE_DOTMATRIX
/* %SSP% Configuration */
/* LCD SPI Peripheral Allocation (USART1) */
#define LCD_BASE_PORT               AT91C_BASE_PIOB
#define LCD_CS_PIN                  PB_12_LCD_CS
#define USART1_US_CR_INIT           LCD_US_CR_INIT
#define USART1_US_MR_INIT           LCD_US_MR_INIT
#define USART1_US_IER_INIT          LCD_US_IER_INIT
#define USART1_US_IDR_INIT          LCD_US_IDR_INIT
#define USART1_US_BRGR_INIT         LCD_US_BRGR_INIT

#define SSP1_IRQHandler             USART1_IrqHandler
#endif /* EIE_DOTMATRIX */


/* ANT SPI Peripheral Allocation (USART2) */
#define ANT_SPI_CS_GPIO             AT91C_BASE_PIOB
#define ANT_SPI_CS_PIN              PB_22_ANT_USPI2_CS
#define USART2_US_CR_INIT           ANT_SPI_US_CR_INIT
#define USART2_US_MR_INIT           ANT_SPI_US_MR_INIT
#define USART2_US_IER_INIT          ANT_SPI_US_IER_INIT
#define USART2_US_IDR_INIT          ANT_SPI_US_IDR_INIT
#define USART2_US_BRGR_INIT         ANT_SPI_US_BRGR_INIT

#define SSP2_IRQHandler             USART2_IrqHandler


/* %I2C% Configuration */

/* EiE I2C (TWI0) */
#define TWI0_CR_INIT                EIE_TWI_CR_INIT
#define TWI0_MMR_INIT               EIE_TWI_MMR_INIT
#define TWI0_CWGR_INIT              EIE_TWI_CWGR_INIT
#define TWI0_IER_INIT               EIE_TWI_IER_INIT

#define TWI0_IRQHandler             Twi0_IrqHandler


/*! @endcond */
/***********************************************************************************************************************
##### UART peripheral board-specific parameters
***********************************************************************************************************************/
/*! @cond DOXYGEN_EXCLUDE */

/*----------------------------------------------------------------------------------------------------------------------
Debug UART Setup

Debug is used for the terminal (serial: 115.2k, 8-N-1) debugging interface.
*/
/* USART Control Register */
#define DEBUG_UART_US_CR_INIT (u32)0x00000050
/*
    31 - 20 [0] Reserved

    19 [0] RTSDIS/RCS no release/force RTS to 1
    18 [0] RTSEN/FCS no drive/force RTS to 0
    17 [0] DTRDIS no drive DTR to 1
    16 [0] DTREN no drive DTR to 0

    15 [0] RETTO no restart timeout
    14 [0] RSTNACK N/A
    13 [0] RSTIT N/A
    12 [0] SENDA N/A

    11 [0] STTTO no start time-out
    10 [0] STPBRK no stop break
    09 [0] STTBRK no transmit break
    08 [0] RSTSTA status bits not reset

    07 [0] TXDIS transmitter not disabled
    06 [1] TXEN transmitter enabled
    05 [0] RXDIS receiver not disabled
    04 [1] RXEN receiver enabled

    03 [0] RSTTX not reset
    02 [0] RSTRX not reset
    01 [0] Reserved
    00 [0] "
*/

/* USART Mode Register */
#define DEBUG_UART_US_MR_INIT (u32)0x000008C0
/*
    31 [0] ONEBIT start frame delimiter is COMMAND or DATA SYNC
    30 [0] MODSYNC Manchester start bit N/A
    29 [0] MAN Machester encoding disabled
    28 [0] FILTER no filter on Rx line

    27 [0] Reserved
    26 [0] MAX_ITERATION (ISO7816 mode only)
    25 [0] "
    24 [0] "

    23 [0] INVDATA data is not inverted
    22 [0] VAR_SYNC sync field 
    21 [0] DSNACK delicious! NACK is sent on ISO line immediately on parity error
    20 [0] INACK NACK generated (N/A for async)

    19 [0] OVER 16x oversampling
    18 [0] CLKO USART does not drive the SCK pin
    17 [0] MODE9 CHRL defines char length
    16 [0] MSBF/CPOL LSB first

    15 [0] CHMODE normal mode
    14 [0] "
    13 [0] NBSTOP 1 stop bit
    12 [0] "

    11 [1] PAR no parity
    10 [0] "
    09 [0] "
    08 [0] SYNC/CPHA asynchronous

    07 [1] CHRL 8 bits
    06 [1] "
    05 [0] USCLKS MCK
    04 [0] "

    03 [0] USART_MODE normal
    02 [0] "
    01 [0] "
    00 [0] "
*/


/* USART Interrupt Enable Register */
#define DEBUG_UART_US_IER_INIT (u32)0x00000008
/*
    31 [0] Reserved
    30 [0] "
    29 [0] "
    28 [0] "

    27 [0] "
    26 [0] "
    25 [0] "
    24 [0] MANE Manchester Error interrupt not enabled

    23 [0] Reserved
    22 [0] "
    21 [0] "
    20 [0] "

    19 [0] CTSIC Clear to Send Change interrupt not enabled
    18 [0] DCDIC Data Carrier Detect Change interrupt not enabled
    17 [0] DSRIC Data Set Ready Change interrupt not enabled
    16 [0] RIIC Ring Inidicator Change interrupt not enabled

    15 [0] Reserved
    14 [0] "
    13 [0] NACK Non Ack interrupt not enabled
    12 [0] RXBUFF Reception Buffer Full (PDC) interrupt not enabled

    11 [0] TXBUFE Transmission Buffer Empty (PDC) interrupt not enabled
    10 [0] ITER/UNRE Max number of Repetitions Reached interrupt not enabled
    09 [0] TXEMPTY Transmitter Empty interrupt not enabled (yet)
    08 [0] TIMEOUT Receiver Time-out interrupt not enabled

    07 [0] PARE Parity Error interrupt not enabled
    06 [0] FRAME Framing Error interrupt not enabled
    05 [0] OVRE Overrun Error interrupt not enabled
    04 [0] ENDTX End of Transmitter Transfer (PDC) interrupt not enabled yet

    03 [1] ENDRX End of Receiver Transfer (PDC) interrupt enabled
    02 [0] RXBRK Break Received interrupt not enabled
    01 [0] TXRDY Transmitter Ready interrupt not enabled
    00 [0] RXRDY Receiver Ready interrupt enabled
*/

/* USART Interrupt Disable Register */
#define DEBUG_UART_US_IDR_INIT (u32)~DEBUG_UART_US_IER_INIT

/* USART Baud Rate Generator Register 
BAUD = MCK / (8(2-OVER)(CD + FP / 8))
=> CD = (MCK / (8(2-OVER)BAUD)) - (FP / 8)
MCK = 48MHz
OVER = 0 (16-bit oversampling)

BAUD desired = 38400 bps
=> CD = 78.125 - (FP / 8)
Set FP = 1, CD = 78 = 0x4E

BAUD desired = 115200 bps
=> CD = 26.042 - (FP / 8)
Set FP = 0, CD = 26 = 0x1A

*/
#define DEBUG_UART_US_BRGR_INIT (u32)0x0000001A
/*
    31-20 [0] Reserved

    19 [0] Reserved
    18 [0] FP = 0
    17 [0] "
    16 [0] "

    15 [0] CD = 26 = 0x1A
    14 [0] "
    13 [0] "
    12 [0] "

