eiefirmware/razor_sam3u2/firmware_common/bsp/configuration.h
    11 [0] "
    10 [0] "
    09 [0] "
    08 [0] "

    07 [0] "
    06 [0] "
    05 [0] "
    04 [1] "

    03 [1] "
    02 [0] "
    01 [1] "
    00 [0] "
*/


/*----------------------------------------------------------------------------------------------------------------------
Blade UART Setup

The Blade UART is used for the daughter board interface (serial: 115.2k, 8-N-1) .
*/
/* USART Control Register */
#define BLADE_UART_US_CR_INIT (u32)0x00000050
/*
    31 - 20 [0] Reserved

    19 [0] RTSDIS/RCS no release/force RTS to 1
    18 [0] RTSEN/FCS no drive/force RTS to 0
    17 [0] DTRDIS no drive DTR to 1
    16 [0] DTREN no drive DTR to 0

    15 [0] RETTO no restart timeout
    14 [0] RSTNACK N/A
    13 [0] RSTIT N/A
    12 [0] SENDA N/A

    11 [0] STTTO no start time-out
    10 [0] STPBRK no stop break
    09 [0] STTBRK no transmit break
    08 [0] RSTSTA status bits not reset

    07 [0] TXDIS transmitter not disabled
    06 [1] TXEN transmitter enabled
    05 [0] RXDIS receiver not disabled
    04 [1] RXEN receiver enabled

    03 [0] RSTTX not reset
    02 [0] RSTRX not reset
    01 [0] Reserved
    00 [0] "
*/

/* USART Mode Register */
#define BLADE_UART_US_MR_INIT (u32)0x000008C0
/*
    31 [0] ONEBIT start frame delimiter is COMMAND or DATA SYNC
    30 [0] MODSYNC Manchester start bit N/A
    29 [0] MAN Machester encoding disabled
    28 [0] FILTER no filter on Rx line

    27 [0] Reserved
    26 [0] MAX_ITERATION (ISO7816 mode only)
    25 [0] "
    24 [0] "

    23 [0] INVDATA data is not inverted
    22 [0] VAR_SYNC sync field 
    21 [0] DSNACK delicious! NACK is sent on ISO line immeidately on parity error
    20 [0] INACK NACK generated (N/A for async)

    19 [0] OVER 16x oversampling
    18 [0] CLKO USART does not drive the SCK pin
    17 [0] MODE9 CHRL defines char length
    16 [0] MSBF/CPOL LSB first

    15 [0] CHMODE normal mode
    14 [0] "
    13 [0] NBSTOP 1 stop bit
    12 [0] "

    11 [1] PAR no parity
    10 [0] "
    09 [0] "
    08 [0] SYNC/CPHA asynchronous

    07 [1] CHRL 8 bits
    06 [1] "
    05 [0] USCLKS MCK
    04 [0] "

    03 [0] USART_MODE normal
    02 [0] "
    01 [0] "
    00 [0] "
*/


/* USART Interrupt Enable Register */
#define BLADE_UART_US_IER_INIT (u32)0x00000008
/*
    31 [0] Reserved
    30 [0] "
    29 [0] "
    28 [0] "

    27 [0] "
    26 [0] "
    25 [0] "
    24 [0] MANE Manchester Error interrupt not enabled

    23 [0] Reserved
    22 [0] "
    21 [0] "
    20 [0] "

    19 [0] CTSIC Clear to Send Change interrupt not enabled
    18 [0] DCDIC Data Carrier Detect Change interrupt not enabled
    17 [0] DSRIC Data Set Ready Change interrupt not enabled
    16 [0] RIIC Ring Inidicator Change interrupt not enabled

    15 [0] Reserved
    14 [0] "
    13 [0] NACK Non Ack interrupt not enabled
    12 [0] RXBUFF Reception Buffer Full (PDC) interrupt not enabled

    11 [0] TXBUFE Transmission Buffer Empty (PDC) interrupt not enabled
    10 [0] ITER/UNRE Max number of Repetitions Reached interrupt not enabled
    09 [0] TXEMPTY Transmitter Empty interrupt not enabled (yet)
    08 [0] TIMEOUT Receiver Time-out interrupt not enabled

    07 [0] PARE Parity Error interrupt not enabled
    06 [0] FRAME Framing Error interrupt not enabled
    05 [0] OVRE Overrun Error interrupt not enabled
    04 [0] ENDTX End of Transmitter Transfer (PDC) interrupt not enabled yet

    03 [1] ENDRX End of Receiver Transfer (PDC) interrupt enabled
    02 [0] RXBRK Break Received interrupt not enabled
    01 [0] TXRDY Transmitter Ready interrupt not enabled
    00 [0] RXRDY Receiver Ready interrupt not enabled
*/

/* USART Interrupt Disable Register */
#define BLADE_UART_US_IDR_INIT (u32)~BLADE_UART_US_IER_INIT

/* USART Baud Rate Generator Register
BAUD = MCK / (8(2-OVER)(CD + FP / 8))
=> CD = (MCK / (8(2-OVER)BAUD)) - (FP / 8)
MCK = 48MHz
OVER = 0 (16-bit oversampling)

BAUD desired = 115200 bps
=> CD = 26.042 - (FP / 8)
Set FP = 0, CD = 26

*/
#define BLADE_UART_US_BRGR_INIT (u32)0x0000001A
/*
    31-20 [0] Reserved

    19 [0] Reserved
    18 [0] FP = 0
    17 [0] "
    16 [0] "

    15 [0] CD = 26 = 0x1A
    14 [0] "
    13 [0] "
    12 [0] "

    11 [0] "
    10 [0] "
    09 [0] "
    08 [0] "

    07 [0] "
    06 [0] "
    05 [0] "
    04 [1] "

    03 [1] "
    02 [0] "
    01 [1] "
    00 [0] "
*/


/*! @endcond */
/***********************************************************************************************************************
$$$$$ SPI peripheral board-specific parameters
***********************************************************************************************************************/
/*! @cond DOXYGEN_EXCLUDE */

/*----------------------------------------------------------------------------------------------------------------------
Blade SPI Setup 

SPI mode to communicate with a Slave device on the Blade connector. 
*/
/* SPI Control Register */
#define BLADE_SPI_CR_INIT (u32)0x00000002
/*
    31 - 28 [0] Reserved

    27 [0] Reserved
    26 [0] "
    25 [0] "
    24 [0] LASTXFER not required

    23 - 8 [0] Reserved

    07 [0] SWRST not reset
    06 [0] Reserved
    05 [0] "
    04 [0] "

    03 [0] Reserved
    02 [0] "
    01 [1] SPIDIS SPI disabled for now
    00 [0] SPIEN SPI not enabled yet
*/

/* SPI Mode Register */
#define BLADE_SPI_MR_INIT (u32)0x00000021
/*
    31 [0] DLYBCS Delay Between Chip Selects not applicable
    30 [0] "
    29 [0] "
    28 [0] "

    27 [0] "
    26 [0] "
    25 [0] "
    24 [0] "

    23 [0] Reserved
    22 [0] "
    21 [0] "
    20 [0] "

    19 [0] PCS Peripheral Chip Select select CS0
    18 [0] "
    17 [0] "
    16 [0] "

    15 - 08 [0] Reserved 

    07 [0] LLB Local Loopback disabled
    06 [0] Reserved
    05 [1] WDRBT Wait Data Before Transfer enabled
    04 [0] MODFDIS Mode Fault not disabled

    03 [0] Reserved
    02 [0] PCSDEC chip select direct connect
    01 [0] PS Fixed Peripheral Select
    00 [1] MSTR Master mode
*/

/* SPI Interrupt Enable Register */
#define BLADE_SPI_IER_INIT (u32)0x00000000
/*
    31 - 12 [0] Reserved 

    11 [0] Reserved
    10 [0] UNDES not enabled
    09 [0] TXEMPTY not enabled
    08 [0] NSSR not enabled

    07 [0] Reserved
    06 [0] "
    05 [0] "
    04 [0] "

    03 [0] OVRES not enabled
    02 [0] MODF not enabled
    01 [0] TDRE not enabled yet
    00 [0] RDRF not enabled yet
*/

/* SPI Interrupt Disable Register  */
#define BLADE_SPI_IDR_INIT (u32)~BLADE_SPI_IER_INIT

/* SPI Baud Rate Generator Register
BAUD = MCK / SCBR 
=> SCBR = MCK / BAUD
BAUD desired = 1 Mbps
=> SCBR = 48

Delay before SPCK: target 10us
DLYBS = SPCK x MCK = 10us x 48MHz = 480

Delay between transfers: target 3us (3 clock ticks)
Delay = (32 x DLYBCT) / MCK
DLYBCT = (3us x 48MHz) / 32
DLYBCT = 4.5 (round up to 5)
*/
#define BLADE_SPI_CSR0_INIT (u32)0x05303001
/*
    31 [0] DLYBCT Delay between transfers = 5 (0x05)
    30 [0] "
    29 [0] "
    28 [0] "

    27 [0] "
    26 [1] "
    25 [0] "
    24 [1] "

    23 [0] DLYBS Delay before SCK 1us => 48 (0x30)
    22 [0] "
    21 [1] "
    20 [1] "

    19 [0] "
    18 [0] "
    17 [0] "
    16 [0] "

    15 [0] SCBR Serial clock baud rate => 48 (0x30)
    14 [0] "
    13 [1] "
    12 [1] "

